app/views/clientes/_form.html.erb

SELECT `veterinarios`.* FROM `veterinarios` ORDER BY `veterinarios`.`nome` ASC
---
                <%= form.label :veterinario_id, { class: "form-label"} %>
                <%= form.collection_select(:veterinario_id, Veterinario.order(:nome), :id, :nome,{}, { class: "form-select" } )%>

SELECT `pets`.* FROM `pets` ORDER BY `pets`.`id` DESC LIMIT 1
---
              <%= form.label :pet_id, style: "display: block" %>
              <% pi = Pet.all.ids.last%>
              <% pn = Pet.all.last.nome %>