app/views/clientes/_form.html.erb

    <%= form.label :veterinario_id, style: "display: block" %>
    <%= form.select :Veterinario_id, Veterinario.all.collect { |p| p.id } %>
---
SELECT `veterinarios`.* FROM `veterinarios`