app/controllers/clientes_controller.rb

  def index
      @clientes = Cliente.page params[:page]
---
SELECT COUNT(*) FROM `clientes`
SELECT `clientes`.* FROM `clientes` LIMIT 20 OFFSET 0

  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save
---
INSERT INTO `clientes` (`nome`, `email`, `bairro`, `rua`, `veterinario_id`, `pet_id`, `created_at`, `updated_at`) VALUES ('junin', 'xuxa@baixinho.com', 'fi da xuxa', 'baixa da egua', 4, 10, '2022-02-15 22:09:24.947744', '2022-02-15 22:09:24.947744')

  def update
    respond_to do |format|
      if @cliente.update(cliente_params)
---
UPDATE `clientes` SET `clientes`.`nome` = 'arielle kellen ', `clientes`.`updated_at` = '2022-02-15 14:45:41.636566' WHERE `clientes`.`id` = 8

  def destroy
    @cliente.destroy
---
DELETE FROM `clientes` WHERE `clientes`.`id` = 1

    def set_cliente
      @cliente = Cliente.find(params[:id])
---
SELECT `clientes`.* FROM `clientes` WHERE `clientes`.`id` = 14 LIMIT 1