app/controllers/consulta_controller.rb

    def search
        @clientes = Cliente.where('nome like ?',
"%#{params[:q]}%")
---
SELECT `clientes`.* FROM `clientes` WHERE (title like '%h%' OR author like '%h%')