app/controllers/pets_controller.rb

SELECT `pets`.* FROM `pets`
---
  def index
    @pets = Pet.all

INSERT INTO `pets` (`nome`, `idade`, `created_at`, `updated_at`) VALUES ('haninho perereco', 62, '2022-02-14 01:38:21.107716', '2022-02-14 01:38:21.107716')
---
  def create
    @pet = Pet.new(pet_params)

    respond_to do |format|
      if @pet.save

DELETE FROM `pets` WHERE `pets`.`id` = 1
---
  def destroy
    @pet.destroy

SELECT `pets`.* FROM `pets` WHERE `pets`.`id` = 4 LIMIT 1
---
    def set_pet
      @pet = Pet.find(params[:id])