app/controllers/veterinarios_controller.rb

SELECT COUNT(*) FROM `veterinarios`
SELECT `veterinarios`.* FROM `veterinarios` LIMIT 2 OFFSET 0
---
  def index
    @veterinarios = Veterinario.page params[:page]

INSERT INTO `veterinarios` (`nome`, `preco`, `created_at`, `updated_at`) VALUES ('João', 'R$30', '2022-02-14 17:43:28.645137', '2022-02-14 17:43:28.645137')
---
  def create
    @veterinario = Veterinario.new(veterinario_params)

    respond_to do |format|
      if @veterinario.save

DELETE FROM `veterinarios` WHERE `veterinarios`.`id` = 1
---
  def destroy
    @veterinario.destroy

SELECT `veterinarios`.* FROM `veterinarios` WHERE `veterinarios`.`id` = 1 LIMIT 1
---
    def set_veterinario
      @veterinario = Veterinario.find(params[:id])