app/models/cliente.rb

  def self.to_csv
         CSV.generate(headers: true, col_sep: ";") do |csv|
          csv << ["Id","Nome", "Email", "Bairro", "Rua", "Veterinário",
                  "Pet"]

            all.each do |cliente|
---
SELECT `clientes`.* FROM `clientes`